In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
sns.set(style='darkgrid')

In [5]:
df=pd.read_csv('fortune500.csv')

In [6]:
df.tail()

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
25495,2005,496,Wm. Wrigley Jr.,3648.6,493
25496,2005,497,Peabody Energy,3631.6,175.4
25497,2005,498,Wendy's International,3630.4,57.8
25498,2005,499,Kindred Healthcare,3616.6,70.6
25499,2005,500,Cincinnati Financial,3614.0,584

In [7]:
df.head()

   Year  Rank           Company  Revenue (in millions) Profit (in millions)
0  1955     1    General Motors                 9823.5                  806
1  1955     2       Exxon Mobil                 5661.4                584.8
2  1955     3        U.S. Steel                 3250.4                195.4
3  1955     4  General Electric                 2959.1                212.6
4  1955     5            Esmark                 2510.8                 19.1

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25500 entries, 0 to 25499
Data columns (total 5 columns):
Year                     25500 non-null int64
Rank                     25500 non-null int64
Company                  25500 non-null object
Revenue (in millions)    25500 non-null float64
Profit (in millions)     25500 non-null object
dtypes: float64(1), int64(2), object(2)
memory usage: 996.2+ KB

In [9]:
df.dtypes.value_counts()

int64      2
object     2
float64    1
dtype: int64

In [10]:
df.columns.value_counts()

Revenue (in millions)    1
Rank                     1
Company                  1
Year                     1
Profit (in millions)     1
dtype: int64

In [12]:
df.shape

(25500, 5)

In [13]:
df.columns

Index(['Year', 'Rank', 'Company', 'Revenue (in millions)',
       'Profit (in millions)'],
      dtype='object')

In [14]:
df.columns.tolist()

['Year', 'Rank', 'Company', 'Revenue (in millions)', 'Profit (in millions)']

In [15]:
df.isnull().values.any()

False

In [19]:
df.describe()

              Year          Rank  Revenue (in millions)
count  25500.00000  25500.000000           25500.000000
mean    1980.00000    250.499765            4273.329635
std       14.71989    144.339963           11351.884979
min     1955.00000      1.000000              49.700000
25%     1967.00000    125.750000             362.300000
50%     1980.00000    250.500000            1019.000000
75%     1993.00000    375.250000            3871.000000
max     2005.00000    500.000000          288189.000000